import {
  Br,
  Description,
  Group,
  Image,
  ReversedGroup,
  ReverseSubTitle,
  SpeakerImage,
  SubTitle,
  Title,
  Wrap,
  Wrapper,
} from './style';
import chevoler from '../../img/chevoler.png';
import speaker from '../../img/speaker.png';
import aboutphoto from '../../img/aboutcamp.png';

export const AboutCamp = () => {
  return (
    <Wrap>
      <Title>ПРО ТАБІР</Title>
      <Wrapper>
        <Group>
          <Image src={chevoler} />
          <Description>
            {' '}
            Chevalier Panorama розташований в селі Яблуниця, на висоті близько
            1000 м над рівнем моря. Завдяки цьому з вікон готелю Ви можете
            спостерігати за найвищими точками України – Говерлою та вершинами
            Чорногірського хребта.
          </Description>
          <SubTitle>БАЗА CHEVALIER PANORAMA</SubTitle>
        </Group>
        <ReversedGroup>
          <SpeakerImage src={speaker} />
          <Description>
            {' '}
            Єпископ Хмельницької області, Україна. Пастор церкви «Світло
            Христове» м. Камянець-Подільський, яка являється материнською
            церквою декількох церков. Також в 2010 році відкриває церкву
            «Благодать Христа» у м. Хмельницький, де також являється пастором.
            Ставить собі за мету щоби у кожному районі Хмельницької області і в
            кожному районі більших міст була євангельська церква, сповідуючи
            принцип «краще 5 невеликих церков чим одна мега церква» У
            пасторському служінні велику увагу приділяє «вихованю» нових
            служителів. Являючись відомим спікером, часто можна побачити на
            різних конференціях, семінарах, також викладає у Богословських
            семінаріях.
          </Description>
          <ReverseSubTitle>СПІКЕР РОСТИСЛАВ МУРАХ</ReverseSubTitle>
        </ReversedGroup>
        <Group>
          <Image src={aboutphoto} />
          <Description>
            {' '}
            Spirit Time місце єдності та служіння.
            <Br>
              Ми організовуємо зимові та літні табори вже впродовж декількох
              років. Сумарно в наших таборах побувало більше 1500 унікальних
              учасників. #spiritcamp22 буде наш четвертий зимовий табір.
            </Br>
            <Br>
              Якщо коротко описати наші зимові табори це: дуже багато молоді,
              затишна атмосфера, спільне прагнення глибокого пізнання Бога. Ми з
              командою робимо все, щоб створити для вас максимально затишну
              атмосферу, щоб ви змогли відпочити духом та тілом, вирости духовно
              та знайти багато нових знайомств. Програма в нас дуже насичена,
              проте матимите багато вільного часу.
            </Br>
          </Description>
          <SubTitle>КОМАНДА SPIRITTIME</SubTitle>
        </Group>
      </Wrapper>
    </Wrap>
  );
};
